Documents/ЗагрузкаЛидов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗагрузкаЛидов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Конверсии</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кампания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеКампании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Конверсии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторИгрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКонверсии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонверсий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДепозита</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыКонверсий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКонверсий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Лид</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Депозит</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗагрузкаЛидов/Ext/ManagerModule.bsl
Функция СформироватьПечатнуюФорму(ДокументСсылка) Экспорт
	
	Макет = Документы.ЗагрузкаЛидов.ПолучитьМакет("МакетЗагрузки");
	ТабДок = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗагрузкаЛидов.Номер КАК Номер,
	|	ЗагрузкаЛидов.Дата КАК Дата,
	|	ЗагрузкаЛидов.Кампания КАК Кампания,
	|	ЗагрузкаЛидов.Кампания.Оффер КАК Оффер,
	|	ЗагрузкаЛидов.Кампания.Оффер.Валюта КАК Валюта
	|ИЗ
	|	Документ.ЗагрузкаЛидов КАК ЗагрузкаЛидов
	|ГДЕ
	|	ЗагрузкаЛидов.Ссылка = &Ссылка
	|;
	|
	|ВЫБРАТЬ
	|	Конверсии.ИдентификаторИгрока КАК ИдентификаторИгрока,
	|	Конверсии.ТипКонверсии КАК ТипКонверсии,
	|	Конверсии.СуммаДепозита КАК СуммаДепозита
	|ИЗ
	|	Документ.ЗагрузкаЛидов.Конверсии КАК Конверсии
	|ГДЕ
	|	Конверсии.Ссылка = &Ссылка";
	Результаты = Запрос.ВыполнитьПакет();
	
	Шапка = Результаты[0].Выбрать();
	Если Не Шапка.Следующий() Тогда
		Возврат ТабДок;
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Номер = Шапка.Номер;
	Область.Параметры.Дата = Формат(Шапка.Дата, "ДЛФ=D");
	Область.Параметры.Кампания = Шапка.Кампания;
	Область.Параметры.Оффер = Шапка.Оффер;
	ТабДок.Вывести(Область);
	
	ТабДок.Вывести(Макет.ПолучитьОбласть("ШапкаТаблицы"));
	
	ЛидыИтого = 0;
	ДепозитыИтого = 0;
	СуммаИтого = 0;
	Выборка = Результаты[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		Область = Макет.ПолучитьОбласть("Строка");
		Область.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Область);
		Если Выборка.ТипКонверсии = Перечисления.ТипыКонверсий.Лид Тогда
			ЛидыИтого = ЛидыИтого + 1;
		Иначе
			ДепозитыИтого = ДепозитыИтого + 1;
			СуммаИтого = СуммаИтого + Выборка.СуммаДепозита;
		КонецЕсли;
	КонецЦикла;
	
	Область = Макет.ПолучитьОбласть("Итого");
	Область.Параметры.ЛидыИтого = ЛидыИтого;
	Область.Параметры.ДепозитыИтого = ДепозитыИтого;
	Область.Параметры.СуммаИтого = Формат(СуммаИтого, "ЧДЦ=2; ЧН=0,00");
	Область.Параметры.Валюта = Шапка.Валюта;
	ТабДок.Вывести(Область);
	ТабДок.Вывести(Макет.ПолучитьОбласть("Подвал"));
	
	ТабДок.Область(1, 1, 1, 1).ШиринаКолонки = 25;
	ТабДок.Область(1, 2, 1, 2).ШиринаКолонки = 20;
	ТабДок.Область(1, 3, 1, 3).ШиринаКолонки = 15;
	
	Возврат ТабДок;
	
КонецФункции
